app/controllers/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("description", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Let's try this"], ["position", 1], ["created_at", "2021-03-17 02:06:11.952134"], ["updated_at", "2021-03-17 02:06:11.952134"]]

  def update
    respond_to do |format|
      if @todo.update(todo_params)
---
UPDATE "todos" SET "position" = ("todos"."position" + 1), "updated_at" = '2021-03-17 02:06:11.958709' WHERE (1 = 1) AND ("todos"."position" >= 1)

    def set_todo
      @todo = Todo.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]